from get_data_sample import get_notes_samples


def test_get_data_sample():
    note_samples = {}
    collated_text = """
    ༄༅། །ཆོས་ཀྱི་སྐུ་ལ་གནས་པའི་ཡོན་ཏན་ཐུན་མོང་མ་ཡིན་པ་ལ་བསྟོད་པ།(༡) <མཚན་བྱང་འདི་གཞུང་ལས་བླངས་ཏེ་བཀོད་ཅིང་།«སྡེ»ཆོས་ཀྱི་སྐུ་ལ་གནས་པའི་ཡོན་ཏན་ལ་བསྟོད་པ་བཞུགས།«པེ་»«སྣར་»ཆོས་ཀྱི་སྐུ་ལ་གནས་པའི་ཡོན་ཏན་ཐུན་མོང་མ་ཡིན་པ་ལ་བསྟོད་པ་བཞུགས་སོ།།>
༄༅༅། །ཆོས་ཀྱི་སྐུ་ལ་གནས་པའི་ཡོན་ཏན་ཐུན་མོང་མ་ཡིན་པ་ལ་བསྟོད་
ཐོགས་པ་མི་མངའ་རྟག་ཏུ་ཡང་། །མཉམ་པར་གཞག་(༢) <«སྣར་»བཞག>ཅིང་འདྲི་ཀུན་གྱི། །ལན་
1-169
འཚལ་ལོ། །ཆེད་དུ་ཞུ་(༡) <«པེ་»«སྣར་»བཞུད།>དང་དེ་དག་གི། །ཚིག་དང་སྤྱོད་མཁྱེན་འོངས་པ་དང་། :།
མཐོང་བ་ཙམ་གྱིས་དད་འགྱུར་བར། །མཛད་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ལེན་
དང་གནས་དང་གཏོང་བ་དང་། །སྤྲུལ་པ་དང་ནི་བསྒྱུར་བ་དང་། །ཏིང་ངེ་
འཛིན་དང་ཡེ་ཤེས་ལ། །མངའ་བརྙེས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ཐབས་དང་
སྐྱབས་དང་དག་པ་དང་། །ངེས་འབྱུང་ཐེག་པ་ཆེན་པོ་ལ། །སེམས་ཅན་རྣམས་
ལ་སླུ་(༢) <«པེ་»«སྣར་»བསླུ།>བ་ཡི། །བདུད་འཇོམས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ཡེ་ཤེས་དང་ནི་སྤངས་པ་
མཛད་པ། །ཀུན་ནས་ཉོན་མོངས་གཏན་སྤངས་ལ(༣) <«པེ་»«སྣར་»པ།>། །བསྲུང་བ་མི་མངའ་བསྙེལ་
མི་མངའ། །ཚོགས་སྡུད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །གཤེགས་བཞུགས་ཀུན་དུ་རྟག་
བྱང་ཆུབ་ཆེན་པོའི་རྣམ་པ་ཀུན། །སྐུ་གསུམ་(༤) <«པེ་»«སྣར་»གསུང་།>དག་གིས་བརྙེས་གྱུར་པ། །ཀུན་དུ་
སེམས་ཅན་ཐམས་ཅད་ཀྱི། །དོགས་གཅོད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །སྲི་བ་མི་་་
འཚལ་ལོ། །ཆེད་དུ་ཞུ་(༡) <«པེ་»«སྣར་»བཞུད།>དང་དེ་དག་གི། །ཚིག་དང་སྤྱོད་མཁྱེན་འོངས་པ་དང་།
    """
    note_samples = get_notes_samples(collated_text, note_samples)
    expected_note_samples = {
        'བསྟོད་པ།<མཚན་བྱང་འདི་གཞུང་ལས་བླངས་ཏེ་བཀོད་ཅིང་།«སྡེ»ཆོས་ཀྱི་སྐུ་ལ་གནས་པའི་ཡོན་ཏན་ལ་བསྟོད་པ་བཞུགས།«པེ་»«སྣར་»ཆོས་ཀྱི་སྐུ་ལ་གནས་པའི་ཡོན་ཏན་ཐུན་མོང་མ་ཡིན་པ་ལ་བསྟོད་པ་བཞུགས་སོ།།>༄༅༅། །': 1,
        'པར་གཞག་<«སྣར་»བཞག>ཅིང་འདྲི་': 1,
        'དུ་ཞུ་<«པེ་»«སྣར་»བཞུད།>དང་དེ་': 2,
        '།མཐོང་བ་ཙམ་གྱིས་དད་འགྱུར་བར། །མཛད་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ལེན་དང་གནས་དང་གཏོང་བ་དང་། །སྤྲུལ་པ་དང་ནི་བསྒྱུར་བ་དང་། །ཏིང་ངེ་འཛིན་དང་ཡེ་ཤེས་ལ། །མངའ་བརྙེས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ཐབས་དང་སྐྱབས་དང་དག་པ་དང་། །ངེས་འབྱུང་ཐེག་པ་ཆེན་པོ་ལ། །སེམས་ཅན་རྣམས་ལ་སླུ་<«པེ་»«སྣར་»བསླུ།>བ་ཡི།': 1,
        'སྤངས་ལ<«པེ་»«སྣར་»པ།>། །': 1,
        'སྐུ་གསུམ་<«པེ་»«སྣར་»གསུང་།>དག་གིས་': 1

    }
    assert note_samples == expected_note_samples


if __name__ == "__main__":
    test_get_data_sample()